Белгипрозем_2017/src/Catalogs/ДелегированиеПрав/ДелегированиеПрав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДелегированиеПрав</name>
  <attributes>
    <name>ОтКого</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантДелегирования</name>
    <type>
      <types>EnumRef.ВариантыДелегированияПрав</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаПередачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбластиДелегирования</name>
    <attributes>
      <name>ОбластьДелегирования</name>
      <type>
        <types>CatalogRef.ОбластиДелегированияПрав</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Enums/ВариантыДелегированияПрав/ВариантыДелегированияПрав.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыДелегированияПрав</name>
  <enumValues>
    <name>ВсеПрава</name>
  </enumValues>
  <enumValues>
    <name>Выборочно</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/ДелегированиеПрав/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда 
		Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		ВариантДелегирования = Перечисления.ВариантыДелегированияПрав.ВсеПрава;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ЭтотОбъект.Действует = ДокументооборотПраваДоступаПереопределяемый.ПравилоДелегированияПравДействует(ЭтотОбъект);
	
	Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'От: %1 кому: %2 (%3)'"),
		ОтКого,
		Кому,
		ВариантДелегирования);
	
КонецПроцедуры
